namespace DomainModel.Invoice
{
    public class DownloadInvoiceItem
    {
        // ----------------------------------------------------------------------------
        /// <summary>
        /// A letöltendő számla
        /// </summary>
        // ----------------------------------------------------------------------------
        public byte[] InvoiceDocument { get; set; }

        // ----------------------------------------------------------------------------
        /// <summary>
        /// Számla száma
        /// </summary>
        // ----------------------------------------------------------------------------
        public string InvoiceNumber { get; set; }

        // ----------------------------------------------------------------------------
        /// <summary>
        /// Eredmény 
        /// </summary>
        // ----------------------------------------------------------------------------
        public string QueryResultCode { get; set; }
    }
}
